<a href="https://colab.research.google.com/github/Renju-thomson/Python-Data-Analysis/blob/main/Titanic_Survival.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(pd.read_csv("/content/train (1).csv"))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape

(891, 12)

Handling the null values

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Separate the columns that have more than 30% of aluess missing from the list

In [ ]:
x = df.isnull().sum()

drop_col = x[x>(30/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis=1, inplace = True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
df.fillna(df.mean(), inplace = True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
df["Embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [ ]:
df["Embarked"].fillna("S", inplace = True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

sibsp = Number of Siblngs/Spouses Abroad

parch = Number of parents/children abroad

So we can make a new column by cimbining these two columns

In [ ]:
df["Family"] = df["SibSp"] + df["Parch"]
df.drop(["SibSp", "Parch"], axis = 1, inplace= True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare    Family
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658 -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307  0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500  0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566 -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000  0.217138
Family         -0.040143  0.016639  0.065997 -0.248512  0.217138  1.000000

In [ ]:
df["Alone"] = [0 if df["Family"][0]> i else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked Family  Alone
0            1         0       3  ...        S      1      0
1            2         1       1  ...        C      1      1
2            3         1       3  ...        S      0      1
3            4         1       1  ...        S      1      1
4            5         0       3  ...        S      0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(["Alone"])["Survived"].mean()

Alone
0    0.00000
1    0.38427
Name: Survived, dtype: float64

In [ ]:
df[["Alone", "Fare"]].corr()

          Alone      Fare
Alone  1.000000  0.016842
Fare   0.016842  1.000000

so we can see that if the person was not alone, the chance the ticket price is higher is very high.

In [ ]:
df["Sex"] = [0 if df["Sex"][i]== "male"  else 1 for i in df.index]
df.groupby(["Sex"])["Survived"].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows female passangers have more chance for surviving than males

In [ ]:
df.groupby(["Embarked"])["Survived"].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

CONCLUSION



*   Female passangers were prioritized over males
*   Passangers travelling with their family have higher chance of survival

*   Passangers with high class or rich people have higher rate of surviving than others